Revit 2027 API
ParameterTypeId.SteelElemWeldMainPrepdepth Property
 "Main Preparation Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainPrepdepth { get; }
Public Shared ReadOnly Property SteelElemWeldMainPrepdepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainPrepdepth {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainPrepdepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace